cishudian/mpc5744P_CAN_BootLoader/MPC5744P_CAN_Bootloader_and_APP_two_in_one_package_DEKIT-MPC5744P_test_OK_2017.11.09/MPC5744P_CAN_Bootloader_APP_LED_Toggle/src/intc_SW_mode_isr_vectors_MPC5744P.c
/*****************************************************************************/
/* FILE NAME: intc_SW_mode_isr_vectors_MPC5744P.c COPYRIGHT(c) Freescale 2015*/
/*                                                      All Rights Reserved  */
/* DESCRIPTION: MPC5744P ISR vectors for INTC in software vector mode        */
/*              Based on MPC5744P ref manual rev 5.1 Table 7-20.             */
/* USAGE:  For desired vector #, replace "dummy" with ISR name and declare   */
/*         your isr name extern like the example below:                      */
/*                       extern void MyPeripheralISR(void);                  */
/*                                                                           */
/*****************************************************************************/	
/* REV      AUTHOR        DATE        DESCRIPTION OF CHANGE                  */
/* ---   -----------    ----------    ---------------------                  */
/* 1.0	  S Mihalik     03 Aug 2015   Initial version                        */
/*****************************************************************************/
#include "typedefs.h"

#include "MPC574xP_SystemInit.h"

/*========================================================================*/
/*		PROTOTYPES					                                 	  */
/*========================================================================*/
void dummy 						  (void);

/*========================================================================*/
/*	GLOBAL VARIABLES						                              */
/*========================================================================*/

const uint32_t __attribute__ ((section (".intc_vector_table"))) IntcIsrVectorTable[] = {
    
(uint32_t) &dummy, /* Vector #   0 Software settable flag 0 INTC (Software) */
(uint32_t) &dummy, /* Vector #   1 Software settable flag 1 INTC (Software) */
(uint32_t) &dummy, /* Vector #   2 Software settable flag 2 INTC (Software) */
(uint32_t) &dummy, /* Vector #   3 Software settable flag 3 INTC (Software) */
(uint32_t) &dummy, /* Vector #   4 Software settable flag 4 INTC (Software) */
(uint32_t) &dummy, /* Vector #   5 Software settable flag 5 INTC (Software) */
(uint32_t) &dummy, /* Vector #   6 Software settable flag 6 INTC (Software) */
(uint32_t) &dummy, /* Vector #   7 Software settable flag 7 INTC (Software) */
(uint32_t) &dummy, /* Vector #   8 Software settable flag 8 INTC (Software) */
(uint32_t) &dummy, /* Vector #   9 Software settable flag 9 INTC (Software) */
(uint32_t) &dummy, /* Vector #  10 Software settable flag 10 INTC (Software) */
(uint32_t) &dummy, /* Vector #  11 Software settable flag 11 INTC (Software) */
(uint32_t) &dummy, /* Vector #  12 Software settable flag 12 INTC (Software) */
(uint32_t) &dummy, /* Vector #  13 Software settable flag 13 INTC (Software) */
(uint32_t) &dummy, /* Vector #  14 Software settable flag 14 INTC (Software) */
(uint32_t) &dummy, /* Vector #  15 Software settable flag 15 INTC (Software) */
(uint32_t) &dummy, /* Vector #  16 Reserved */
(uint32_t) &dummy, /* Vector #  17 Reserved */
(uint32_t) &dummy, /* Vector #  18 Reserved */
(uint32_t) &dummy, /* Vector #  19 Reserved */
(uint32_t) &dummy, /* Vector #  20 Reserved */
(uint32_t) &dummy, /* Vector #  21 Reserved */
(uint32_t) &dummy, /* Vector #  22 Reserved */
(uint32_t) &dummy, /* Vector #  23 Reserved */
(uint32_t) &dummy, /* Vector #  24 Reserved */
(uint32_t) &dummy, /* Vector #  25 Reserved */
(uint32_t) &dummy, /* Vector #  26 Reserved */
(uint32_t) &dummy, /* Vector #  27 Reserved */
(uint32_t) &dummy, /* Vector #  28 Reserved */
(uint32_t) &dummy, /* Vector #  29 Reserved */
(uint32_t) &dummy, /* Vector #  30 Reserved */
(uint32_t) &dummy, /* Vector #  31 Reserved */
(uint32_t) &dummy, /* Vector #  32 Platform software watchdog timeout Software watchdog timer */
(uint32_t) &dummy, /* Vector #  33 Reserved for Platform watchdog timer1 */
(uint32_t) &dummy, /* Vector #  34 Reserved for Platform watchdog timer2 */
(uint32_t) &dummy, /* Vector #  35 Reserved for Platform watchdog timer3 */
(uint32_t) &dummy, /* Vector #  36 Platform periodic timer 0_0 (STM) STM */
(uint32_t) &dummy, /* Vector #  37 Platform periodic timer 0_1 (STM) STM */
(uint32_t) &dummy, /* Vector #  38 Platform periodic timer 0_2 (STM) STM */
(uint32_t) &dummy, /* Vector #  39 Platform periodic timer 0_3 (STM) STM */
(uint32_t) &dummy, /* Vector #  40 Reserved for Platform periodic timer 1_0 (STM) */
(uint32_t) &dummy, /* Vector #  41 Reserved for Platform periodic timer 1_1 (STM) */
(uint32_t) &dummy, /* Vector #  42 Reserved for Platform periodic timer 1_2 (STM) */
(uint32_t) &dummy, /* Vector #  43 Reserved for Platform periodic timer 1_3 (STM) */
(uint32_t) &dummy, /* Vector #  44 Reserved for Platform periodic timer 2_0 (STM) */
(uint32_t) &dummy, /* Vector #  45 Reserved for Platform periodic timer 2_1 (STM) */
(uint32_t) &dummy, /* Vector #  46 Reserved for Platform periodic timer 2_2 (STM) */
(uint32_t) &dummy, /* Vector #  47 Reserved for Platform periodic timer 2_3 (STM) */
(uint32_t) &dummy, /* Vector #  48 Reserved for Platform periodic timer 3_0 (STM) */
(uint32_t) &dummy, /* Vector #  49 Reserved for Platform periodic timer 3_1 (STM) */
(uint32_t) &dummy, /* Vector #  50 Reserved for Platform periodic timer 3_2 (STM) */
(uint32_t) &dummy, /* Vector #  51 Reserved for Platform periodic timer 3_3(STM) */
(uint32_t) &dummy, /* Vector #  52 eDMA Combined Error eDMA */
(uint32_t) &dummy, /* Vector #  53 eDMA Channel 0 eDMA */
(uint32_t) &dummy, /* Vector #  54 eDMA Channel 1 eDMA */
(uint32_t) &dummy, /* Vector #  55 eDMA Channel 2 eDMA */
(uint32_t) &dummy, /* Vector #  56 eDMA Channel 3 eDMA */
(uint32_t) &dummy, /* Vector #  57 eDMA Channel 4 eDMA */
(uint32_t) &dummy, /* Vector #  58 eDMA Channel 5 eDMA */
(uint32_t) &dummy, /* Vector #  59 eDMA Channel 6 eDMA */
(uint32_t) &dummy, /* Vector #  60 eDMA Channel 7 eDMA */
(uint32_t) &dummy, /* Vector #  61 eDMA Channel 8 eDMA */
(uint32_t) &dummy, /* Vector #  62 eDMA Channel 9 eDMA */
(uint32_t) &dummy, /* Vector #  63 eDMA Channel 10 eDMA */
(uint32_t) &dummy, /* Vector #  64 eDMA Channel 11 eDMA */
(uint32_t) &dummy, /* Vector #  65 eDMA Channel 12 eDMA */
(uint32_t) &dummy, /* Vector #  66 eDMA Channel 13 eDMA */
(uint32_t) &dummy, /* Vector #  67 eDMA Channel 14 eDMA */
(uint32_t) &dummy, /* Vector #  68 eDMA Channel 15 eDMA */
(uint32_t) &dummy, /* Vector #  69 eDMA Channel 16 eDMA */
(uint32_t) &dummy, /* Vector #  70 eDMA Channel 17 eDMA */
(uint32_t) &dummy, /* Vector #  71 eDMA Channel 18 eDMA */
(uint32_t) &dummy, /* Vector #  72 eDMA Channel 19 eDMA */
(uint32_t) &dummy, /* Vector #  73 eDMA Channel 20 eDMA */
(uint32_t) &dummy, /* Vector #  74 eDMA Channel 21 eDMA */
(uint32_t) &dummy, /* Vector #  75 eDMA Channel 22 eDMA */
(uint32_t) &dummy, /* Vector #  76 eDMA Channel 23 eDMA */
(uint32_t) &dummy, /* Vector #  77 eDMA Channel 24 eDMA */
(uint32_t) &dummy, /* Vector #  78 eDMA Channel 25 eDMA */
(uint32_t) &dummy, /* Vector #  79 eDMA Channel 26 eDMA */
(uint32_t) &dummy, /* Vector #  80 eDMA Channel 27 eDMA */
(uint32_t) &dummy, /* Vector #  81 eDMA Channel 28 eDMA */
(uint32_t) &dummy, /* Vector #  82 eDMA Channel 29 eDMA */
(uint32_t) &dummy, /* Vector #  83 eDMA Channel 30 eDMA */
(uint32_t) &dummy, /* Vector #  84 eDMA Channel 31 eDMA */
(uint32_t) &dummy, /* Vector #  85 Reserved for eDMA Channel 32 */
(uint32_t) &dummy, /* Vector #  86 Reserved for eDMA Channel 33 */
(uint32_t) &dummy, /* Vector #  87 Reserved for eDMA Channel 34 */
(uint32_t) &dummy, /* Vector #  88 Reserved for eDMA Channel 35 */
(uint32_t) &dummy, /* Vector #  89 Reserved for eDMA Channel 36 */
(uint32_t) &dummy, /* Vector #  90 Reserved for eDMA Channel 37 */
(uint32_t) &dummy, /* Vector #  91 Reserved for eDMA Channel 38 */
(uint32_t) &dummy, /* Vector #  92 Reserved for eDMA Channel 39 */
(uint32_t) &dummy, /* Vector #  93 Reserved for eDMA Channel 40 */
(uint32_t) &dummy, /* Vector #  94 Reserved for eDMA Channel 41 */
(uint32_t) &dummy, /* Vector #  95 Reserved for eDMA Channel 42 */
(uint32_t) &dummy, /* Vector #  96 Reserved for eDMA Channel 43 */
(uint32_t) &dummy, /* Vector #  97 Reserved for eDMA Channel 44 */
(uint32_t) &dummy, /* Vector #  98 Reserved for eDMA Channel 45 */
(uint32_t) &dummy, /* Vector #  99 Reserved for eDMA Channel 46 */
	
(uint32_t) &dummy, /* Vector # 100 Reserved for eDMA Channel 47 */
(uint32_t) &dummy, /* Vector # 101 Reserved for eDMA Channel 48 */
(uint32_t) &dummy, /* Vector # 102 Reserved for eDMA Channel 49 */
(uint32_t) &dummy, /* Vector # 103 Reserved for eDMA Channel 50 */
(uint32_t) &dummy, /* Vector # 104 Reserved for eDMA Channel 51 */
(uint32_t) &dummy, /* Vector # 105 Reserved for eDMA Channel 52 */
(uint32_t) &dummy, /* Vector # 106 Reserved for eDMA Channel 53 */
(uint32_t) &dummy, /* Vector # 107 Reserved for eDMA Channel 54 */
(uint32_t) &dummy, /* Vector # 108 Reserved for eDMA Channel 55 */
(uint32_t) &dummy, /* Vector # 109 Reserved for eDMA Channel 56 */
(uint32_t) &dummy, /* Vector # 110 Reserved for eDMA Channel 57 */
(uint32_t) &dummy, /* Vector # 111 Reserved for eDMA Channel 58 */
(uint32_t) &dummy, /* Vector # 112 Reserved for eDMA Channel 59 */
(uint32_t) &dummy, /* Vector # 113 Reserved for eDMA Channel 60 */
(uint32_t) &dummy, /* Vector # 114 Reserved for eDMA Channel 61 */
(uint32_t) &dummy, /* Vector # 115 Reserved for eDMA Channel 62 */
(uint32_t) &dummy, /* Vector # 116 Reserved for eDMA Channel 63 */
(uint32_t) &dummy, /* Vector # 117 Reserved for eDMA Channel 64 */
(uint32_t) &dummy, /* Vector # 118 Reserved for eDMA Channel 65 */
(uint32_t) &dummy, /* Vector # 119 Reserved for eDMA Channel 66 */
(uint32_t) &dummy, /* Vector # 120 Reserved for eDMA Channel 67 */
(uint32_t) &dummy, /* Vector # 121 Reserved for eDMA Channel 68 */
(uint32_t) &dummy, /* Vector # 122 Reserved for eDMA Channel 69 */
(uint32_t) &dummy, /* Vector # 123 Reserved for eDMA Channel 70 */
(uint32_t) &dummy, /* Vector # 124 Reserved for eDMA Channel 71 */
(uint32_t) &dummy, /* Vector # 125 Reserved for eDMA Channel 72 */
(uint32_t) &dummy, /* Vector # 126 Reserved for eDMA Channel 73 */
(uint32_t) &dummy, /* Vector # 127 Reserved for eDMA Channel 74 */
(uint32_t) &dummy, /* Vector # 128 Reserved for eDMA Channel 75 */
(uint32_t) &dummy, /* Vector # 129 Reserved for eDMA Channel 76 */
(uint32_t) &dummy, /* Vector # 130 Reserved for eDMA Channel 77 */
(uint32_t) &dummy, /* Vector # 131 Reserved for eDMA Channel 78 */
(uint32_t) &dummy, /* Vector # 132 Reserved for eDMA Channel 79 */
(uint32_t) &dummy, /* Vector # 133 Reserved for eDMA Channel 80 */
(uint32_t) &dummy, /* Vector # 134 Reserved for eDMA Channel 81 */
(uint32_t) &dummy, /* Vector # 135 Reserved for eDMA Channel 82 */
(uint32_t) &dummy, /* Vector # 136 Reserved for eDMA Channel 83 */
(uint32_t) &dummy, /* Vector # 137 Reserved for eDMA Channel 84 */
(uint32_t) &dummy, /* Vector # 138 Reserved for eDMA Channel 85 */
(uint32_t) &dummy, /* Vector # 139 Reserved for eDMA Channel 86 */
(uint32_t) &dummy, /* Vector # 140 Reserved for eDMA Channel 87 */
(uint32_t) &dummy, /* Vector # 141 Reserved for eDMA Channel 88 */
(uint32_t) &dummy, /* Vector # 142 Reserved for eDMA Channel 89 */
(uint32_t) &dummy, /* Vector # 143 Reserved for eDMA Channel 90 */
(uint32_t) &dummy, /* Vector # 144 Reserved for eDMA Channel 91 */
(uint32_t) &dummy, /* Vector # 145 Reserved for eDMA Channel 92 */
(uint32_t) &dummy, /* Vector # 146 Reserved for eDMA Channel 93 */
(uint32_t) &dummy, /* Vector # 147 Reserved for eDMA Channel 94 */
(uint32_t) &dummy, /* Vector # 148 Reserved for eDMA Channel 95 */
(uint32_t) &dummy, /* Vector # 149 Reserved for eDMA Channel 96 */
(uint32_t) &dummy, /* Vector # 150 Reserved for eDMA Channel 97 */
(uint32_t) &dummy, /* Vector # 151 Reserved for eDMA Channel 98 */
(uint32_t) &dummy, /* Vector # 152 Reserved for eDMA Channel 99 */
(uint32_t) &dummy, /* Vector # 153 Reserved for eDMA Channel 100 */
(uint32_t) &dummy, /* Vector # 154 Reserved for eDMA Channel 101 */
(uint32_t) &dummy, /* Vector # 155 Reserved for eDMA Channel 102 */
(uint32_t) &dummy, /* Vector # 156 Reserved for eDMA Channel 103 */
(uint32_t) &dummy, /* Vector # 157 Reserved for eDMA Channel 104 */
(uint32_t) &dummy, /* Vector # 158 Reserved for eDMA Channel 105 */
(uint32_t) &dummy, /* Vector # 159 Reserved for eDMA Channel 106 */
(uint32_t) &dummy, /* Vector # 160 Reserved for eDMA Channel 107 */
(uint32_t) &dummy, /* Vector # 161 Reserved for eDMA Channel 108 */
(uint32_t) &dummy, /* Vector # 162 Reserved for eDMA Channel 109 */
(uint32_t) &dummy, /* Vector # 163 Reserved for eDMA Channel 110 */
(uint32_t) &dummy, /* Vector # 164 Reserved for eDMA Channel 111 */
(uint32_t) &dummy, /* Vector # 165 Reserved for eDMA Channel 112 */
(uint32_t) &dummy, /* Vector # 166 Reserved for eDMA Channel 113 */
(uint32_t) &dummy, /* Vector # 167 Reserved for eDMA Channel 114 */
(uint32_t) &dummy, /* Vector # 168 Reserved for eDMA Channel 115 */
(uint32_t) &dummy, /* Vector # 169 Reserved for eDMA Channel 116 */
(uint32_t) &dummy, /* Vector # 170 Reserved for eDMA Channel 117 */
(uint32_t) &dummy, /* Vector # 171 Reserved for eDMA Channel 118 */
(uint32_t) &dummy, /* Vector # 172 Reserved for eDMA Channel 119 */
(uint32_t) &dummy, /* Vector # 173 Reserved for eDMA Channel 120 */
(uint32_t) &dummy, /* Vector # 174 Reserved for eDMA Channel 121 */
(uint32_t) &dummy, /* Vector # 175 Reserved for eDMA Channel 122 */
(uint32_t) &dummy, /* Vector # 176 Reserved for eDMA Channel 123 */
(uint32_t) &dummy, /* Vector # 177 Reserved for eDMA Channel 124 */
(uint32_t) &dummy, /* Vector # 178 Reserved for eDMA Channel 125 */
(uint32_t) &dummy, /* Vector # 179 Reserved for eDMA Channel 126 */
(uint32_t) &dummy, /* Vector # 180 Reserved for eDMA Channel 127 */
(uint32_t) &dummy, /* Vector # 181 Reserved for MEMU (Platform error reporting) MEMU */
(uint32_t) &dummy, /* Vector # 182 Reserved for MEMU (Platform error reporting) MEMU */
(uint32_t) &dummy, /* Vector # 183 Reserved for MEMU (Platform error reporting) MEMU */
(uint32_t) &dummy, /* Vector # 184 Reserved for MEMU (Platform error reporting) MEMU */
(uint32_t) &dummy, /* Vector # 185 Flash controller Prog/Erase/Suspend IRQ_0 Platform flash controller */
(uint32_t) &dummy, /* Vector # 186 Reserved for flash controller IRQs Platform flash controller */
(uint32_t) &dummy, /* Vector # 187 Reserved for flash controller IRQs Platform flash controller */
(uint32_t) &dummy, /* Vector # 188 Reserved for flash controller IRQs Platform flash controller */
(uint32_t) &dummy, /* Vector # 189 Reserved for AMU_0 */
(uint32_t) &dummy, /* Vector # 190 Reserved for AMU_1 */
(uint32_t) &dummy, /* Vector # 191 Reserved for AMU_2 */
(uint32_t) &dummy, /* Vector # 192 Reserved for AMU_3 */
(uint32_t) &dummy, /* Vector # 193 Reserved for AMU_4 */
(uint32_t) &dummy, /* Vector # 194 Reserved for AMU_5 */
(uint32_t) &dummy, /* Vector # 195 Reserved for future AMU expansion */
(uint32_t) &dummy, /* Vector # 196 Reserved for future AMU expansion */
(uint32_t) &dummy, /* Vector # 197 Reserved for future AMU expansion */
(uint32_t) &dummy, /* Vector # 198 Reserved for future AMU expansion */
(uint32_t) &dummy, /* Vector # 199 Reserved for Semaphore IOP */

(uint32_t) &dummy, /* Vector # 200 Reserved for Semaphore CPU0 */
(uint32_t) &dummy, /* Vector # 201 Reserved for Semaphore CPU1 */
(uint32_t) &dummy, /* Vector # 202 Reserved for Semaphore CPU_SC */
(uint32_t) &dummy, /* Vector # 203 Reserved for future on-platform modules */
(uint32_t) &dummy, /* Vector # 204 Reserved for future on-platform modules */
(uint32_t) &dummy, /* Vector # 205 Reserved for future on-platform modules */
(uint32_t) &dummy, /* Vector # 206 Reserved for future on-platform modules */
(uint32_t) &dummy, /* Vector # 207 Reserved for future on-platform modules */
(uint32_t) &dummy, /* Vector # 208 Reserved for future on-platform modules */
(uint32_t) &dummy, /* Vector # 209 Reserved for future on-platform modules */
(uint32_t) &dummy, /* Vector # 210 Reserved for future on-platform modules */
(uint32_t) &dummy, /* Vector # 211 Reserved for future on-platform modules */
(uint32_t) &dummy, /* Vector # 212 Reserved for future on-platform modules */
(uint32_t) &dummy, /* Vector # 213 Reserved for future on-platform modules */
(uint32_t) &dummy, /* Vector # 214 Reserved for future on-platform modules */
(uint32_t) &dummy, /* Vector # 215 Reserved for future on-platform modules */
(uint32_t) &dummy, /* Vector # 216 Timer IRQ Ethernet 0 ENET_0 */
(uint32_t) &dummy, /* Vector # 217 TX IRQ Ethernet 0 ENET_0 */
(uint32_t) &dummy, /* Vector # 218 RX IRQ Ethernet 0 ENET_0 */
(uint32_t) &dummy, /* Vector # 219 Error/Generic IRQ1 Ethernet 0 ENET_0 */
(uint32_t) &dummy, /* Vector # 220 Reserved for Ethernet_0_2 */
(uint32_t) &dummy, /* Vector # 221 Reserved for Ethernet_1_0 */
(uint32_t) &dummy, /* Vector # 222 Reserved for Ethernet_1_1 */
(uint32_t) &dummy, /* Vector # 223 Reserved for Ethernet_1_2 */
(uint32_t) &dummy, /* Vector # 224 Reserved for Real Time Counter (RTC) */
(uint32_t) &dummy, /* Vector # 225 Reserved for Autonomous Periodic Interrupt (API) */
(uint32_t) &PIT_Channel0_100ms_ISR, /* Vector # 226 Periodic Interrupt Timer (PIT_0) channel 0 PIT_0 */
(uint32_t) &dummy, /* Vector # 227 Periodic Interrupt Timer (PIT_0) channel 1 PIT_0 */
(uint32_t) &dummy, /* Vector # 228 Periodic Interrupt Timer (PIT_0) channel 2 PIT_0 */
(uint32_t) &dummy, /* Vector # 229 Periodic Interrupt Timer (PIT_0) channel 3 PIT_0 */
(uint32_t) &dummy, /* Vector # 230 Reserved for PITx PIT */
(uint32_t) &dummy, /* Vector # 231 Reserved for PITx PIT */
(uint32_t) &dummy, /* Vector # 232 Reserved for PITx PIT */
(uint32_t) &dummy, /* Vector # 233 Reserved for PITx PIT */
(uint32_t) &dummy, /* Vector # 234 Reserved for PITx PIT */
(uint32_t) &dummy, /* Vector # 235 Reserved for PITx PIT */
(uint32_t) &dummy, /* Vector # 236 Reserved for PITx PIT */
(uint32_t) &dummy, /* Vector # 237 Reserved for PITx PIT */
(uint32_t) &dummy, /* Vector # 238 Reserved for PITx PIT */
(uint32_t) &dummy, /* Vector # 239 Reserved for PIT_RTI PIT */
(uint32_t) &dummy, /* Vector # 240 Reserved */
(uint32_t) &dummy, /* Vector # 241 Reserved */
(uint32_t) &dummy, /* Vector # 242 XOSC counter expired External oscillator */
(uint32_t) &dummy, /* Vector # 243 SIUL2 External Interrupt_0 SIUL2 */
(uint32_t) &dummy, /* Vector # 244 SIUL2 External Interrupt_1 SIUL2 */
(uint32_t) &dummy, /* Vector # 245 SIUL2 External Interrupt_2 SIUL2 */
(uint32_t) &dummy, /* Vector # 246 SIUL2 External Interrupt_3 SIUL2 */
(uint32_t) &dummy, /* Vector # 247 Reserved for SIUL2 External Interrupt_4 SIUL2 */
(uint32_t) &dummy, /* Vector # 248 Reserved for SIUL2 External Interrupt_5 SIUL2 */
(uint32_t) &dummy, /* Vector # 249 Reserved for SIUL2 External Interrupt_6 SIUL2 */
(uint32_t) &dummy, /* Vector # 250 Reserved for SIUL2 External Interrupt_7 SIUL2 */
(uint32_t) &dummy, /* Vector # 251 Safe Mode Interrupt MC_ME */
(uint32_t) &dummy, /* Vector # 252 Mode Transition Interrupt MC_ME */
(uint32_t) &dummy, /* Vector # 253 Invalid Mode Interrupt MC_ME */
(uint32_t) &dummy, /* Vector # 254 Invalid Mode Config MC_ME */
(uint32_t) &dummy, /* Vector # 255 Functional and destructive reset alternate event interrupt MC_RGM */
(uint32_t) &dummy, /* Vector # 256 Reserved */
(uint32_t) &dummy, /* Vector # 257 Reserved */
(uint32_t) &dummy, /* Vector # 258 Reserved */
(uint32_t) &dummy, /* Vector # 259 DSPI_SR[TFUF] | DSPI_SR[RFOF] DSPI0 */
(uint32_t) &dummy, /* Vector # 260 DSPI_SR[EOQF] DSPI0 */
(uint32_t) &dummy, /* Vector # 261 DSPI_SR[TFFF] DSPI0 */
(uint32_t) &dummy, /* Vector # 262 DSPI_SR[TCF] DSPI0 */
(uint32_t) &dummy, /* Vector # 263 DSPI_SR[RFDF] DSPI0 */
(uint32_t) &dummy, /* Vector # 264 Reserved for DSPI0_5 DSPI0 */
(uint32_t) &dummy, /* Vector # 265 Reserved for DSPI0_6 DSPI0 */
(uint32_t) &dummy, /* Vector # 266 Reserved for DSPI0_7 DSPI0 */
(uint32_t) &dummy, /* Vector # 267 Reserved for DSPI0_8 DSPI0 */
(uint32_t) &dummy, /* Vector # 268 DSPI_SR[TFUF] | DSPI_SR[RFOF] DSPI1 */
(uint32_t) &dummy, /* Vector # 269 DSPI_SR[EOQF] DSPI1 */
(uint32_t) &dummy, /* Vector # 270 DSPI_SR[TFFF] DSPI1 */
(uint32_t) &dummy, /* Vector # 271 DSPI_SR[TCF] DSPI1 */
(uint32_t) &dummy, /* Vector # 272 DSPI_SR[RFDF] DSPI1 */
(uint32_t) &dummy, /* Vector # 273 Reserved for DSPI1_5 DSPI1 */
(uint32_t) &dummy, /* Vector # 274 Reserved for DSPI1_6 DSPI1 */
(uint32_t) &dummy, /* Vector # 275 Reserved for DSPI1_7 DSPI1 */
(uint32_t) &dummy, /* Vector # 276 Reserved for DSPI1_8 DSPI1 */
(uint32_t) &dummy, /* Vector # 277 DSPI_SR[TFUF] | DSPI_SR[RFOF] DSPI2 */
(uint32_t) &dummy, /* Vector # 278 DSPI_SR[EOQF] DSPI2 */
(uint32_t) &dummy, /* Vector # 279 DSPI_SR[TFFF] DSPI2 */
(uint32_t) &dummy, /* Vector # 280 DSPI_SR[TCF] DSPI2 */
(uint32_t) &dummy, /* Vector # 281 DSPI_SR[RFDF] DSPI2 */
(uint32_t) &dummy, /* Vector # 282 Reserved for DSPI2_5 DSPI2 */
(uint32_t) &dummy, /* Vector # 283 Reserved for DSPI2_6 DSPI2 */
(uint32_t) &dummy, /* Vector # 284 Reserved for DSPI2_7 DSPI2 */
(uint32_t) &dummy, /* Vector # 285 Reserved for DSPI2_8 DSPI2 */
(uint32_t) &dummy, /* Vector # 286 DSPI_SR[TFUF] | DSPI_SR[RFOF] DSPI3 */
(uint32_t) &dummy, /* Vector # 287 DSPI_SR[EOQF] DSPI3 */
(uint32_t) &dummy, /* Vector # 288 DSPI_SR[TFFF] DSPI3 */
(uint32_t) &dummy, /* Vector # 289 DSPI_SR[TCF] DSPI3 */
(uint32_t) &dummy, /* Vector # 290 DSPI_SR[RFDF] DSPI3 */
(uint32_t) &dummy, /* Vector # 291 Reserved for DSPI3_5 DSPI3 */
(uint32_t) &dummy, /* Vector # 292 Reserved for DSPI3_6 DSPI3 */
(uint32_t) &dummy, /* Vector # 293 Reserved for DSPI3_7 DSPI3 */
(uint32_t) &dummy, /* Vector # 294 Reserved for DSPI3_8 DSPI3 */
(uint32_t) &dummy, /* Vector # 295 Reserved for DSPI4_0 DSPI4 */
(uint32_t) &dummy, /* Vector # 296 Reserved for DSPI4_1 DSPI4 */
(uint32_t) &dummy, /* Vector # 297 Reserved for DSPI4_2 DSPI4 */
(uint32_t) &dummy, /* Vector # 298 Reserved for DSPI4_3 DSPI4 */
(uint32_t) &dummy, /* Vector # 299 Reserved for DSPI4_4 DSPI4 */

