cishudian/mpc5744P_CAN_BootLoader/MPC5744P_CAN_Bootloader_and_APP_two_in_one_package_DEKIT-MPC5744P_test_OK_2017.11.09/MPC5744P_CAN_Bootloader_APP_LED_Toggle/src/intc_SW_mode_isr_vectors_MPC5744P.c
(uint32_t) &dummy, /* Vector # 300 Reserved for DSPI4_5 DSPI4 */
(uint32_t) &dummy, /* Vector # 301 Reserved for DSPI4_6 DSPI4 */
(uint32_t) &dummy, /* Vector # 302 Reserved for DSPI4_7 DSPI4 */
(uint32_t) &dummy, /* Vector # 303 Reserved for DSPI4_8 DSPI4 */
(uint32_t) &dummy, /* Vector # 304 Reserved for DSPI5_0 DSPI5 */
(uint32_t) &dummy, /* Vector # 305 Reserved for DSPI5_1 DSPI5 */
(uint32_t) &dummy, /* Vector # 306 Reserved for DSPI5_2 DSPI5 */
(uint32_t) &dummy, /* Vector # 307 Reserved for DSPI5_3 DSPI5 */
(uint32_t) &dummy, /* Vector # 308 Reserved for DSPI5_4 DSPI5 */
(uint32_t) &dummy, /* Vector # 309 Reserved for DSPI5_5 DSPI5 */
(uint32_t) &dummy, /* Vector # 310 Reserved for DSPI5_6 DSPI5 */
(uint32_t) &dummy, /* Vector # 311 Reserved for DSPI5_7 DSPI5 */
(uint32_t) &dummy, /* Vector # 312 Reserved for DSPI5_4 DSPI5 */
(uint32_t) &dummy, /* Vector # 313 Reserved for DSPI6_0 DSPI6 */
(uint32_t) &dummy, /* Vector # 314 Reserved for DSPI6_1 DSPI6 */
(uint32_t) &dummy, /* Vector # 315 Reserved for DSPI6_2 DSPI6 */
(uint32_t) &dummy, /* Vector # 316 Reserved for DSPI6_3 DSPI6 */
(uint32_t) &dummy, /* Vector # 317 Reserved for DSPI6_4 DSPI6 */
(uint32_t) &dummy, /* Vector # 318 Reserved for DSPI6_5 DSPI6 */
(uint32_t) &dummy, /* Vector # 319 Reserved for DSPI6_6 DSPI6 */
(uint32_t) &dummy, /* Vector # 320 Reserved for DSPI6_7 DSPI6 */
(uint32_t) &dummy, /* Vector # 321 Reserved for DSPI6_8 DSPI6 */
(uint32_t) &dummy, /* Vector # 322 Reserved for DSPI7_0 DSPI7 */
(uint32_t) &dummy, /* Vector # 323 Reserved for DSPI7_1 DSPI7 */
(uint32_t) &dummy, /* Vector # 324 Reserved for DSPI7_2 DSPI7 */
(uint32_t) &dummy, /* Vector # 325 Reserved for DSPI7_3 DSPI7 */
(uint32_t) &dummy, /* Vector # 326 Reserved for DSPI7_4 DSPI7 */
(uint32_t) &dummy, /* Vector # 327 Reserved for DSPI7_5 DSPI7 */
(uint32_t) &dummy, /* Vector # 328 Reserved for DSPI7_6 DSPI7 */
(uint32_t) &dummy, /* Vector # 329 Reserved for DSPI7_7 DSPI7 */
(uint32_t) &dummy, /* Vector # 330 Reserved for DSPI7_8 DSPI7 */
(uint32_t) &dummy, /* Vector # 331 Reserved for DSPI8_0 DSPI8 */
(uint32_t) &dummy, /* Vector # 332 Reserved for DSPI8_1 DSPI8 */
(uint32_t) &dummy, /* Vector # 333 Reserved for DSPI8_2 DSPI8 */
(uint32_t) &dummy, /* Vector # 334 Reserved for DSPI8_3 DSPI8 */
(uint32_t) &dummy, /* Vector # 335 Reserved for DSPI8_4 DSPI8 */
(uint32_t) &dummy, /* Vector # 336 Reserved for DSPI8_5 DSPI8 */
(uint32_t) &dummy, /* Vector # 337 Reserved for DSPI8_6 DSPI8 */
(uint32_t) &dummy, /* Vector # 338 Reserved for DSPI8_7 DSPI8 */
(uint32_t) &dummy, /* Vector # 339 Reserved for DSPI8_8 DSPI8 */
(uint32_t) &dummy, /* Vector # 340 Reserved for DSPI9_0 DSPI9 */
(uint32_t) &dummy, /* Vector # 341 Reserved for DSPI9_1 DSPI9 */
(uint32_t) &dummy, /* Vector # 342 Reserved for DSPI9_2 DSPI9 */
(uint32_t) &dummy, /* Vector # 343 Reserved for DSPI9_3 DSPI9 */
(uint32_t) &dummy, /* Vector # 344 Reserved for DSPI9_4 DSPI9 */
(uint32_t) &dummy, /* Vector # 345 Reserved for DSPI9_5 DSPI9 */
(uint32_t) &dummy, /* Vector # 346 Reserved for DSPI9_6 DSPI9 */
(uint32_t) &dummy, /* Vector # 347 Reserved for DSPI9_7 DSPI9 */
(uint32_t) &dummy, /* Vector # 348 Reserved for DSPI9_8 DSPI9 */
(uint32_t) &dummy, /* Vector # 349 Reserved for DSPI10_0 DSPI10 */
(uint32_t) &dummy, /* Vector # 350 Reserved for DSPI10_1 DSPI10 */
(uint32_t) &dummy, /* Vector # 351 Reserved for DSPI10_2 DSPI10 */
(uint32_t) &dummy, /* Vector # 352 Reserved for DSPI10_3 DSPI10 */
(uint32_t) &dummy, /* Vector # 353 Reserved for DSPI10_4 DSPI10 */
(uint32_t) &dummy, /* Vector # 354 Reserved for DSPI10_5 DSPI10 */
(uint32_t) &dummy, /* Vector # 355 Reserved for DSPI10_6 DSPI10 */
(uint32_t) &dummy, /* Vector # 356 Reserved for DSPI10_7 DSPI10 */
(uint32_t) &dummy, /* Vector # 357 Reserved for DSPI10_8 DSPI10 */
(uint32_t) &dummy, /* Vector # 358 Reserved for DSPI11_0 DSPI11 */
(uint32_t) &dummy, /* Vector # 359 Reserved for DSPI11_1 DSPI11 */
(uint32_t) &dummy, /* Vector # 360 Reserved for DSPI11_2 DSPI11 */
(uint32_t) &dummy, /* Vector # 361 Reserved for DSPI11_3 DSPI11 */
(uint32_t) &dummy, /* Vector # 362 Reserved for DSPI11_4 DSPI11 */
(uint32_t) &dummy, /* Vector # 363 Reserved for DSPI11_5 DSPI11 */
(uint32_t) &dummy, /* Vector # 364 Reserved for DSPI11_6 DSPI11 */
(uint32_t) &dummy, /* Vector # 365 Reserved for DSPI11_7 DSPI11 */
(uint32_t) &dummy, /* Vector # 366 Reserved for DSPI11_8 DSPI11 */
(uint32_t) &dummy, /* Vector # 367 Reserved for DSPI12_0 DSPI12 */
(uint32_t) &dummy, /* Vector # 368 Reserved for DSPI12_1 DSPI12 */
(uint32_t) &dummy, /* Vector # 369 Reserved for DSPI12_2 DSPI12 */
(uint32_t) &dummy, /* Vector # 370 Reserved for DSPI12_3 DSPI12 */
(uint32_t) &dummy, /* Vector # 371 Reserved for DSPI12_4 DSPI12 */
(uint32_t) &dummy, /* Vector # 372 Reserved for DSPI12_5 DSPI12 */
(uint32_t) &dummy, /* Vector # 373 Reserved for DSPI12_6 DSPI12 */
(uint32_t) &dummy, /* Vector # 374 Reserved for DSPI12_7 DSPI12 */
(uint32_t) &dummy, /* Vector # 375 Reserved for DSPI12_8 DSPI12 */
(uint32_t) &dummy, /* Vector # 376 LINFlex_RXI LINFlex_0 */
(uint32_t) &dummy, /* Vector # 377 LINFlex_TXI LINFlex_0 */
(uint32_t) &dummy, /* Vector # 378 LINFlex_ERR LINFlex_0 */
(uint32_t) &dummy, /* Vector # 379 Reserved for LINFlex/eSCI0_3 LINFlex_0 */
(uint32_t) &dummy, /* Vector # 380 LINFlex_RXI LINFlex_1 */
(uint32_t) &dummy, /* Vector # 381 LINFlex_TXI LINFlex_1 */
(uint32_t) &dummy, /* Vector # 382 LINFlex_ERR LINFlex_1 */
(uint32_t) &dummy, /* Vector # 383 Reserved for LINFlex/eSCI1_3 LINFlex_1 */
(uint32_t) &dummy, /* Vector # 384 Reserved for LINFlex/eSCI2_0 LINFlex_2 */
(uint32_t) &dummy, /* Vector # 385 Reserved for LINFlex/eSCI2_1 LINFlex_2 */
(uint32_t) &dummy, /* Vector # 386 Reserved for LINFlex/eSCI2_2 LINFlex_2 */
(uint32_t) &dummy, /* Vector # 387 Reserved for LINFlex/eSCI2_3 LINFlex_2 */
(uint32_t) &dummy, /* Vector # 388 Reserved for LINFlex/eSCI3_0 LINFlex_3 */
(uint32_t) &dummy, /* Vector # 389 Reserved for LINFlex/eSCI3_1 LINFlex_3 */
(uint32_t) &dummy, /* Vector # 390 Reserved for LINFlex/eSCI3_2 LINFlex_3 */
(uint32_t) &dummy, /* Vector # 391 Reserved for LINFlex/eSCI3_3 LINFlex_3 */
(uint32_t) &dummy, /* Vector # 392 Reserved for LINFlex/eSCI4_0 LINFlex_4 */
(uint32_t) &dummy, /* Vector # 393 Reserved for LINFlex/eSCI4_1 LINFlex_4 */
(uint32_t) &dummy, /* Vector # 394 Reserved for LINFlex/eSCI4_2 LINFlex_4 */
(uint32_t) &dummy, /* Vector # 395 Reserved for LINFlex/eSCI4_3 LINFlex_4 */
(uint32_t) &dummy, /* Vector # 396 Reserved for LINFlex/eSCI5_0 LINFlex_5 */
(uint32_t) &dummy, /* Vector # 397 Reserved for LINFlex/eSCI5_1 LINFlex_5 */
(uint32_t) &dummy, /* Vector # 398 Reserved for LINFlex/eSCI5_2 LINFlex_5 */
(uint32_t) &dummy, /* Vector # 399 Reserved for LINFlex/eSCI5_3 LINFlex_5 */

(uint32_t) &dummy, /* Vector # 400 Reserved for LINFlex/eSCI6_0 LINFlex_6 */
(uint32_t) &dummy, /* Vector # 401 Reserved for LINFlex/eSCI6_1 LINFlex_6 */
(uint32_t) &dummy, /* Vector # 402 Reserved for LINFlex/eSCI6_2 LINFlex_6 */
(uint32_t) &dummy, /* Vector # 403 Reserved for LINFlex/eSCI6_3 LINFlex_6 */
(uint32_t) &dummy, /* Vector # 404 Reserved for LINFlex/eSCI7_0 LINFlex_7 */
(uint32_t) &dummy, /* Vector # 405 Reserved for LINFlex/eSCI7_1 LINFlex_7 */
(uint32_t) &dummy, /* Vector # 406 Reserved for LINFlex/eSCI7_2 LINFlex_7 */
(uint32_t) &dummy, /* Vector # 407 Reserved for LINFlex/eSCI7_3 LINFlex_7 */
(uint32_t) &dummy, /* Vector # 408 Reserved for LINFlex/eSCI8_0 LINFlex_8 */
(uint32_t) &dummy, /* Vector # 409 Reserved for LINFlex/eSCI8_1 LINFlex_8 */
(uint32_t) &dummy, /* Vector # 410 Reserved for LINFlex/eSCI8_2 LINFlex_8 */
(uint32_t) &dummy, /* Vector # 411 Reserved for LINFlex/eSCI8_3 LINFlex_8 */
(uint32_t) &dummy, /* Vector # 412 Reserved for LINFlex/eSCI9_0 LINFlex_9 */
(uint32_t) &dummy, /* Vector # 413 Reserved for LINFlex/eSCI9_1 LINFlex_9 */
(uint32_t) &dummy, /* Vector # 414 Reserved for LINFlex/eSCI9_2 LINFlex_9 */
(uint32_t) &dummy, /* Vector # 415 Reserved for LINFlex/eSCI9_3 LINFlex_9 */
(uint32_t) &dummy, /* Vector # 416 Reserved for LINFlex/eSCI10_0 LINFlex_10 */
(uint32_t) &dummy, /* Vector # 417 Reserved for LINFlex/eSCI10_1 LINFlex_10 */
(uint32_t) &dummy, /* Vector # 418 Reserved for LINFlex/eSCI10_2 LINFlex_10 */
(uint32_t) &dummy, /* Vector # 419 Reserved for LINFlex/eSCI10_3 LINFlex_10 */
(uint32_t) &dummy, /* Vector # 420 Reserved for LINFlex/eSCI11_0 LINFlex_11 */
(uint32_t) &dummy, /* Vector # 421 Reserved for LINFlex/eSCI11_1 LINFlex_11 */
(uint32_t) &dummy, /* Vector # 422 Reserved for LINFlex/eSCI11_2 LINFlex_11 */
(uint32_t) &dummy, /* Vector # 423 Reserved for LINFlex/eSCI11_3 LINFlex_11 */
(uint32_t) &dummy, /* Vector # 424 Reserved for LINFlex/eSCI12_0 LINFlex_12 */
(uint32_t) &dummy, /* Vector # 425 Reserved for LINFlex/eSCI12_1 LINFlex_12 */
(uint32_t) &dummy, /* Vector # 426 Reserved for LINFlex/eSCI12_2 LINFlex_12 */
(uint32_t) &dummy, /* Vector # 427 Reserved for LINFlex/eSCI12_3 LINFlex_12 */
(uint32_t) &dummy, /* Vector # 428 Reserved for LINFlex/eSCI13_0 LINFlex_13 */
(uint32_t) &dummy, /* Vector # 429 Reserved for LINFlex/eSCI13_1 LINFlex_13 */
(uint32_t) &dummy, /* Vector # 430 Reserved for LINFlex/eSCI13_2 LINFlex_13 */
(uint32_t) &dummy, /* Vector # 431 Reserved for LINFlex/eSCI13_3 LINFlex_13 */
(uint32_t) &dummy, /* Vector # 432 Reserved for LINFlex/eSCI14_0 LINFlex_14 */
(uint32_t) &dummy, /* Vector # 433 Reserved for LINFlex/eSCI14_1 LINFlex_14 */
(uint32_t) &dummy, /* Vector # 434 Reserved for LINFlex/eSCI14_2 LINFlex_14 */
(uint32_t) &dummy, /* Vector # 435 Reserved for LINFlex/eSCI14_3 LINFlex_14 */
(uint32_t) &dummy, /* Vector # 436 Reserved for LINFlex/eSCI15_0 LINFlex_15 */
(uint32_t) &dummy, /* Vector # 437 Reserved for LINFlex/eSCI15_1 LINFlex_15 */
(uint32_t) &dummy, /* Vector # 438 Reserved for LINFlex/eSCI15_2 LINFlex_15 */
(uint32_t) &dummy, /* Vector # 439 Reserved for LINFlex/eSCI15_3 LINFlex_15 */
(uint32_t) &dummy, /* Vector # 440 Reserved for IIC_0_0 */
(uint32_t) &dummy, /* Vector # 441 Reserved for IIC_0_1 */
(uint32_t) &dummy, /* Vector # 442 Reserved for IIC_1_0 */
(uint32_t) &dummy, /* Vector # 443 Reserved for IIC_1_1 */
(uint32_t) &dummy, /* Vector # 444 Reserved for IIC_2_0 */
(uint32_t) &dummy, /* Vector # 445 Reserved for IIC_2_1 */
(uint32_t) &dummy, /* Vector # 446 Reserved for IIC_3_0 */
(uint32_t) &dummy, /* Vector # 447 Reserved for IIC_3_1 */
(uint32_t) &dummy, /* Vector # 448 Reserved for future use */
(uint32_t) &dummy, /* Vector # 449 Reserved for future use */
(uint32_t) &dummy, /* Vector # 450 Reserved for future use */
(uint32_t) &dummy, /* Vector # 451 Reserved for future use */
(uint32_t) &dummy, /* Vector # 452 Reserved for future use */
(uint32_t) &dummy, /* Vector # 453 LRNEIF | DRNEIF FlexRay_0 */
(uint32_t) &dummy, /* Vector # 454 LRCEIF | DRCEIF FlexRay_0 */
(uint32_t) &dummy, /* Vector # 455 FNEAIF FlexRay_0 */
(uint32_t) &dummy, /* Vector # 456 FNEBIF FlexRay_0 */
(uint32_t) &dummy, /* Vector # 457 WUPIF FlexRay_0 */
(uint32_t) &dummy, /* Vector # 458 PRIF FlexRay_0 */
(uint32_t) &dummy, /* Vector # 459 CHIF FlexRay_0 */
(uint32_t) &dummy, /* Vector # 460 TBIF FlexRay_0 */
(uint32_t) &dummy, /* Vector # 461 RBIF FlexRay_0 */
(uint32_t) &dummy, /* Vector # 462 MIF FlexRay_0 */
(uint32_t) &dummy, /* Vector # 463 Reserved for FlexRay_0_10 FlexRay_0 */
(uint32_t) &dummy, /* Vector # 464 Reserved for FlexRay_0_11 FlexRay_0 */
(uint32_t) &dummy, /* Vector # 465 Reserved for FlexRay_1_0 FlexRay_1 */
(uint32_t) &dummy, /* Vector # 466 Reserved for FlexRay_1_1 FlexRay_1 */
(uint32_t) &dummy, /* Vector # 467 Reserved for FlexRay_1_2 FlexRay_1 */
(uint32_t) &dummy, /* Vector # 468 Reserved for FlexRay_1_3 FlexRay_1 */
(uint32_t) &dummy, /* Vector # 469 Reserved for FlexRay_1_4 FlexRay_1 */
(uint32_t) &dummy, /* Vector # 470 Reserved for FlexRay_1_5 FlexRay_1 */
(uint32_t) &dummy, /* Vector # 471 Reserved for FlexRay_1_6 FlexRay_1 */
(uint32_t) &dummy, /* Vector # 472 Reserved for FlexRay_1_7 FlexRay_1 */
(uint32_t) &dummy, /* Vector # 473 Reserved for FlexRay_1_8 FlexRay_1 */
(uint32_t) &dummy, /* Vector # 474 Reserved for FlexRay_1_9 FlexRay_1 */
(uint32_t) &dummy, /* Vector # 475 Reserved for FlexRay_1_10 FlexRay_1 */
(uint32_t) &dummy, /* Vector # 476 Reserved for FlexRay_1_11 FlexRay_1 */
(uint32_t) &dummy, /* Vector # 477 Power Monitor Unit PMU */
(uint32_t) &dummy, /* Vector # 478 Power management Unit (temp sensor) PMU */
(uint32_t) &dummy, /* Vector # 479 Reserved for Clock Monitor Unit CMU */
(uint32_t) &dummy, /* Vector # 480 Reserved for PLL_0 PLL_0 */
(uint32_t) &dummy, /* Vector # 481 Reserved for PLL_0 PLL_0 */
(uint32_t) &dummy, /* Vector # 482 Reserved for PLL_1 PLL_1 */
(uint32_t) &dummy, /* Vector # 483 Reserved for PLL_1 PLL_1 */
(uint32_t) &dummy, /* Vector # 484 Reserved for ipi_int_ext_pd1_done */
(uint32_t) &dummy, /* Vector # 485 Reserved for ipi_int_ext_pd2_done */
(uint32_t) &dummy, /* Vector # 486 Reserved for ipi_int_pll1_clk_sw */
(uint32_t) &dummy, /* Vector # 487 Reserved for ipi_int_pll2_clk_sw */
(uint32_t) &dummy, /* Vector # 488 Alarm Interrupt (ALRM) FCCU */
(uint32_t) &dummy, /* Vector # 489 Configuration Time-out (CFG_TO) FCCU */
(uint32_t) &dummy, /* Vector # 490 Reserved for FCCU FCCU */
(uint32_t) &dummy, /* Vector # 491 Reserved for FCCU FCCU */
(uint32_t) &dummy, /* Vector # 492 Reserved for FCCU_4 FCCU */
(uint32_t) &dummy, /* Vector # 493 Reserved for FCCU_5 FCCU */
(uint32_t) &dummy, /* Vector # 494 Reserved for FCCU_6 FCCU */
(uint32_t) &dummy, /* Vector # 495 Reserved for FCCU_7 FCCU */
(uint32_t) &dummy, /* Vector # 496 ADC_EOC ADC_0 */
(uint32_t) &dummy, /* Vector # 497 ADC_ER ADC_0 */
(uint32_t) &dummy, /* Vector # 498 ADC_WD ADC_0 */
(uint32_t) &dummy, /* Vector # 499 Reserved for ADC ADC_0 */
	
(uint32_t) &dummy, /* Vector # 500 ADC_EOC ADC_1 */
(uint32_t) &dummy, /* Vector # 501 ADC_ER ADC_1 */
(uint32_t) &dummy, /* Vector # 502 ADC_WD ADC_1 */
(uint32_t) &dummy, /* Vector # 503 Reserved for ADC ADC_1 */
(uint32_t) &dummy, /* Vector # 504 ADC_EOC ADC_2 */
(uint32_t) &dummy, /* Vector # 505 ADC_ER ADC_2 */
(uint32_t) &dummy, /* Vector # 506 ADC_WD ADC_2 */
(uint32_t) &dummy, /* Vector # 507 Reserved for ADC ADC_2 */
(uint32_t) &dummy, /* Vector # 508 ADC_EOC ADC_3 */
(uint32_t) &dummy, /* Vector # 509 ADC_ER ADC_3 */
(uint32_t) &dummy, /* Vector # 510 ADC_WD ADC_3 */
(uint32_t) &dummy, /* Vector # 511 Reserved for ADC ADC_3 */
(uint32_t) &dummy, /* Vector # 512 Reserved for ADC ADC_4 */
(uint32_t) &dummy, /* Vector # 513 Reserved for ADC ADC_4 */
(uint32_t) &dummy, /* Vector # 514 Reserved for ADC ADC_4 */
(uint32_t) &dummy, /* Vector # 515 Reserved for ADC ADC_4 */
(uint32_t) &dummy, /* Vector # 516 Reserved for ADC ADC_5 */
(uint32_t) &dummy, /* Vector # 517 Reserved for ADC ADC_5 */
(uint32_t) &dummy, /* Vector # 518 Reserved for ADC ADC_5 */
(uint32_t) &dummy, /* Vector # 519 Reserved for ADC ADC_5 */
(uint32_t) &dummy, /* Vector # 520 FLEXCAN_ESR[ERR_INT] FlexCAN_0 */
(uint32_t) &dummy, /* Vector # 521 FLEXCAN_ESR_BOFF | FLEXCAN_Transmit_Warning | FLEXCAN_Receive_Warning FlexCAN_0 */
(uint32_t) &dummy, /* Vector # 522 FLEXCAN_BUF_00_03 FlexCAN_0 */
(uint32_t) &dummy, /* Vector # 523 FLEXCAN_BUF_04_07 FlexCAN_0 */
(uint32_t) &dummy, /* Vector # 524 FLEXCAN_BUF_08_11 FlexCAN_0 */
(uint32_t) &dummy, /* Vector # 525 FLEXCAN_BUF_12_15 FlexCAN_0 */
(uint32_t) &dummy, /* Vector # 526 FLEXCAN_BUF_16_31 FlexCAN_0 */
(uint32_t) &dummy, /* Vector # 527 FLEXCAN_BUF_32_39 FlexCAN_0 */
(uint32_t) &dummy, /* Vector # 528 FLEXCAN_BUF_40_47 FlexCAN_0 */
(uint32_t) &dummy, /* Vector # 529 FLEXCAN_BUF_48_55 FlexCAN_0 */
(uint32_t) &dummy, /* Vector # 530 FLEXCAN_BUF_56_63 FlexCAN_0 */
(uint32_t) &dummy, /* Vector # 531 Reserved FlexCAN_0 */
(uint32_t) &dummy, /* Vector # 532 Reserved FlexCAN_0 */
(uint32_t) &dummy, /* Vector # 533 FLEXCAN_ESR[ERR_INT] FlexCAN_1 */
(uint32_t) &dummy, /* Vector # 534 FLEXCAN_ESR_BOFF | FLEXCAN_Transmit_Warning | FLEXCAN_Receive_Warning FlexCAN_1 */
(uint32_t) &dummy, /* Vector # 535 FLEXCAN_BUF_00_03 FlexCAN_1 */
(uint32_t) &dummy, /* Vector # 536 FLEXCAN_BUF_04_07 FlexCAN_1 */
(uint32_t) &dummy, /* Vector # 537 FLEXCAN_BUF_08_11 FlexCAN_1 */
(uint32_t) &dummy, /* Vector # 538 FLEXCAN_BUF_12_15 FlexCAN_1 */
(uint32_t) &dummy, /* Vector # 539 FLEXCAN_BUF_16_31 FlexCAN_1 */
(uint32_t) &dummy, /* Vector # 540 FLEXCAN_BUF_32_39 FlexCAN_1 */
(uint32_t) &dummy, /* Vector # 541 FLEXCAN_BUF_40_47 FlexCAN_1 */
(uint32_t) &dummy, /* Vector # 542 FLEXCAN_BUF_48_55 FlexCAN_1 */
(uint32_t) &dummy, /* Vector # 543 FLEXCAN_BUF_56_63 FlexCAN_1 */
(uint32_t) &dummy, /* Vector # 544 Reserved FlexCAN_1 */
(uint32_t) &dummy, /* Vector # 545 Reserved FlexCAN_1 */
(uint32_t) &dummy, /* Vector # 546 FLEXCAN_ESR[ERR_INT] FlexCAN_2 */
(uint32_t) &dummy, /* Vector # 547 FLEXCAN_ESR_BOFF | FLEXCAN_Transmit_Warning | FLEXCAN_Receive_Warning FlexCAN_2 */
(uint32_t) &dummy, /* Vector # 548 FLEXCAN_BUF_00_03 FlexCAN_2 */
(uint32_t) &dummy, /* Vector # 549 FLEXCAN_BUF_04_07 FlexCAN_2 */
(uint32_t) &dummy, /* Vector # 550 FLEXCAN_BUF_08_11 FlexCAN_2 */
(uint32_t) &dummy, /* Vector # 551 FLEXCAN_BUF_12_15 FlexCAN_2 */
(uint32_t) &dummy, /* Vector # 552 FLEXCAN_BUF_16_31 FlexCAN_2 */
(uint32_t) &dummy, /* Vector # 553 FLEXCAN_BUF_32_39 FlexCAN_2 */
(uint32_t) &dummy, /* Vector # 554 FLEXCAN_BUF_40_47 FlexCAN_2 */
(uint32_t) &dummy, /* Vector # 555 FLEXCAN_BUF_48_55 FlexCAN_2 */
(uint32_t) &dummy, /* Vector # 556 FLEXCAN_BUF_56_63 FlexCAN_2 */
(uint32_t) &dummy, /* Vector # 557 Reserved FlexCAN_2 */
(uint32_t) &dummy, /* Vector # 558 Reserved FlexCAN_2 */
(uint32_t) &dummy, /* Vector # 559 Reserved FlexCAN_3 */
(uint32_t) &dummy, /* Vector # 560 Reserved FlexCAN_3 */
(uint32_t) &dummy, /* Vector # 561 Reserved FlexCAN_3 */
(uint32_t) &dummy, /* Vector # 562 Reserved FlexCAN_3 */
(uint32_t) &dummy, /* Vector # 563 Reserved FlexCAN_3 */
(uint32_t) &dummy, /* Vector # 564 Reserved FlexCAN_3 */
(uint32_t) &dummy, /* Vector # 565 Reserved FlexCAN_3 */
(uint32_t) &dummy, /* Vector # 566 Reserved FlexCAN_3 */
(uint32_t) &dummy, /* Vector # 567 Reserved FlexCAN_3 */
(uint32_t) &dummy, /* Vector # 568 Reserved FlexCAN_3 */
(uint32_t) &dummy, /* Vector # 569 Reserved FlexCAN_3 */
(uint32_t) &dummy, /* Vector # 570 Valid Fast Message Received on Channel 0 SENT_0 */
(uint32_t) &dummy, /* Vector # 571 Valid Slow Message Received on Channel 0 SENT_0 */
(uint32_t) &dummy, /* Vector # 572 Receive Error Interrupt Channel 0 SENT_0 */
(uint32_t) &dummy, /* Vector # 573 Valid Fast Message Received on Channel 1 SENT_0 */
(uint32_t) &dummy, /* Vector # 574 Valid Slow Message Received on Channel 1 SENT_0 */
(uint32_t) &dummy, /* Vector # 575 Receive Error Interrupt Channel 1 SENT_0 */
(uint32_t) &dummy, /* Vector # 576 Reserved SENT_0 */
(uint32_t) &dummy, /* Vector # 577 Reserved SENT_0 */
(uint32_t) &dummy, /* Vector # 578 Reserved SENT_0 */
(uint32_t) &dummy, /* Vector # 579 Reserved SENT_0 */
(uint32_t) &dummy, /* Vector # 580 Reserved SENT_0 */
(uint32_t) &dummy, /* Vector # 581 Reserved SENT_0 */
(uint32_t) &dummy, /* Vector # 582 Valid Fast Message Received on Channel 0 SENT_1 */
(uint32_t) &dummy, /* Vector # 583 Valid Slow Message Received on Channel 0 SENT_1 */
(uint32_t) &dummy, /* Vector # 584 Receive Error Interrupt Channel 0 SENT_1 */
(uint32_t) &dummy, /* Vector # 585 Valid Fast Message Received on Channel 1 SENT_1 */
(uint32_t) &dummy, /* Vector # 586 Valid Slow Message Received on Channel 1 SENT_1 */
(uint32_t) &dummy, /* Vector # 587 Receive Error Interrupt Channel 1 SENT_1 */
(uint32_t) &dummy, /* Vector # 588 Reserved SENT_1 */
(uint32_t) &dummy, /* Vector # 589 Reserved SENT_1 */
(uint32_t) &dummy, /* Vector # 590 Reserved SENT_1 */
(uint32_t) &dummy, /* Vector # 591 Reserved SENT_1 */
(uint32_t) &dummy, /* Vector # 592 Reserved SENT_1 */
(uint32_t) &dummy, /* Vector # 593 Reserved SENT_1 */
(uint32_t) &dummy, /* Vector # 594 Read interrupt channel 1 SIPI */
(uint32_t) &dummy, /* Vector # 595 Read interrupt channel 2 SIPI */
(uint32_t) &dummy, /* Vector # 596 Read interrupt channel 3 SIPI */
(uint32_t) &dummy, /* Vector # 597 Read interrupt channel 4 SIPI */
(uint32_t) &dummy, /* Vector # 598 Reserved SIPI */
(uint32_t) &dummy, /* Vector # 599 Reserved SIPI */

