cishudian/mpc5744P_CAN_BootLoader/MPC5744P_CAN_Bootloader_and_APP_two_in_one_package_DEKIT-MPC5744P_test_OK_2017.11.09/MPC5744P_CAN_Bootloader_APP_LED_Toggle/src/intc_SW_mode_isr_vectors_MPC5744P.c
(uint32_t) &dummy, /* Vector # 600 Reserved SIPI */
(uint32_t) &dummy, /* Vector # 601 Reserved SIPI */
(uint32_t) &dummy, /* Vector # 602 Error 1 SIPI */
(uint32_t) &dummy, /* Vector # 603 Error 2 SIPI */
(uint32_t) &dummy, /* Vector # 604 Trigger command SIPI */
(uint32_t) &dummy, /* Vector # 605 Tx interrupt LFAST0 */
(uint32_t) &dummy, /* Vector # 606 Tx exception LFAST0 */
(uint32_t) &dummy, /* Vector # 607 Rx interrupt LFAST0 */
(uint32_t) &dummy, /* Vector # 608 Rx exception LFAST0 */
(uint32_t) &dummy, /* Vector # 609 Rx ICLC LFAST0 */
(uint32_t) &dummy, /* Vector # 610 Reserved LFAST0 */
(uint32_t) &dummy, /* Vector # 611 TC0IR eTimer_0 */
(uint32_t) &dummy, /* Vector # 612 TC1IR eTimer_0 */
(uint32_t) &dummy, /* Vector # 613 TC2IR eTimer_0 */
(uint32_t) &dummy, /* Vector # 614 TC3IR eTimer_0 */
(uint32_t) &dummy, /* Vector # 615 TC4IR eTimer_0 */
(uint32_t) &dummy, /* Vector # 616 TC5IR eTimer_0 */
(uint32_t) &dummy, /* Vector # 617 Not used Reserved eTimer_0 */
(uint32_t) &dummy, /* Vector # 618 Not used Reserved eTimer_0 */
(uint32_t) &dummy, /* Vector # 619 WTIF eTimer_0 */
(uint32_t) &dummy, /* Vector # 620 Not used Reserved eTimer_0 */
(uint32_t) &dummy, /* Vector # 621 RCF eTimer_0 */
(uint32_t) &dummy, /* Vector # 622 TC0IR eTimer_1 */
(uint32_t) &dummy, /* Vector # 623 TC1IR eTimer_1 */
(uint32_t) &dummy, /* Vector # 624 TC2IR eTimer_1 */
(uint32_t) &dummy, /* Vector # 625 TC3IR eTimer_1 */
(uint32_t) &dummy, /* Vector # 626 TC4IR eTimer_1 */
(uint32_t) &dummy, /* Vector # 627 TC5IR eTimer_1 */
(uint32_t) &dummy, /* Vector # 628 Not used Reserved eTimer_1 */
(uint32_t) &dummy, /* Vector # 629 Not used Reserved eTimer_1 */
(uint32_t) &dummy, /* Vector # 630 Not used Reserved eTimer_1 */
(uint32_t) &dummy, /* Vector # 631 Not used Reserved eTimer_1 */
(uint32_t) &dummy, /* Vector # 632 RCF eTimer_1 */
(uint32_t) &dummy, /* Vector # 633 TC0IR eTimer_2 */
(uint32_t) &dummy, /* Vector # 634 TC1IR eTimer_2 */
(uint32_t) &dummy, /* Vector # 635 TC2IR eTimer_2 */
(uint32_t) &dummy, /* Vector # 636 TC3IR eTimer_2 */
(uint32_t) &dummy, /* Vector # 637 TC4IR eTimer_2 */
(uint32_t) &dummy, /* Vector # 638 TC5IR eTimer_2 */
(uint32_t) &dummy, /* Vector # 639 Not used Reserved eTimer_2 */
(uint32_t) &dummy, /* Vector # 640 Not used Reserved eTimer_2 */
(uint32_t) &dummy, /* Vector # 641 Not used Reserved eTimer_2 */
(uint32_t) &dummy, /* Vector # 642 Not used Reserved eTimer_2 */
(uint32_t) &dummy, /* Vector # 643 RCF eTimer_2 */
(uint32_t) &dummy, /* Vector # 644 Not used eTimer_3 */
(uint32_t) &dummy, /* Vector # 645 Not used eTimer_3 */
(uint32_t) &dummy, /* Vector # 646 Not used eTimer_3 */
(uint32_t) &dummy, /* Vector # 647 Not used eTimer_3 */
(uint32_t) &dummy, /* Vector # 648 Not used eTimer_3 */
(uint32_t) &dummy, /* Vector # 649 Not used eTimer_3 */
(uint32_t) &dummy, /* Vector # 650 Not used Reserved eTimer_3 */
(uint32_t) &dummy, /* Vector # 651 Not used Reserved eTimer_3 */
(uint32_t) &dummy, /* Vector # 652 Not used Reserved eTimer_3 */
(uint32_t) &dummy, /* Vector # 653 Not used Reserved eTimer_3 */
(uint32_t) &dummy, /* Vector # 654 Not used eTimer_3 */
(uint32_t) &dummy, /* Vector # 655 RF0 FlexPWM_0 */
(uint32_t) &dummy, /* Vector # 656 COF0 FlexPWM_0 */
(uint32_t) &dummy, /* Vector # 657 CAF0 FlexPWM_0 */
(uint32_t) &dummy, /* Vector # 658 RF1 FlexPWM_0 */
(uint32_t) &dummy, /* Vector # 659 COF1 FlexPWM_0 */
(uint32_t) &dummy, /* Vector # 660 CAF1 FlexPWM_0 */
(uint32_t) &dummy, /* Vector # 661 RF2 FlexPWM_0 */
(uint32_t) &dummy, /* Vector # 662 COF2 FlexPWM_0 */
(uint32_t) &dummy, /* Vector # 663 CAF2 FlexPWM_0 */
(uint32_t) &dummy, /* Vector # 664 RF3 FlexPWM_0 */
(uint32_t) &dummy, /* Vector # 665 COF3 FlexPWM_0 */
(uint32_t) &dummy, /* Vector # 666 CAF3 FlexPWM_0 */
(uint32_t) &dummy, /* Vector # 667 FFLAG FlexPWM_0 */
(uint32_t) &dummy, /* Vector # 668 REF FlexPWM_0 */
(uint32_t) &dummy, /* Vector # 669 Reserved FlexPWM_0 */
(uint32_t) &dummy, /* Vector # 670 RF0 FlexPWM_1 */
(uint32_t) &dummy, /* Vector # 671 COF0 FlexPWM_1 */
(uint32_t) &dummy, /* Vector # 672 CAF0 FlexPWM_1 */
(uint32_t) &dummy, /* Vector # 673 RF1 FlexPWM_1 */
(uint32_t) &dummy, /* Vector # 674 COF1 FlexPWM_1 */
(uint32_t) &dummy, /* Vector # 675 CAF1 FlexPWM_1 */
(uint32_t) &dummy, /* Vector # 676 RF2 FlexPWM_1 */
(uint32_t) &dummy, /* Vector # 677 COF2 FlexPWM_1 */
(uint32_t) &dummy, /* Vector # 678 CAF2 FlexPWM_1 */
(uint32_t) &dummy, /* Vector # 679 RF3 FlexPWM_1 */
(uint32_t) &dummy, /* Vector # 680 COF3 FlexPWM_1 */
(uint32_t) &dummy, /* Vector # 681 CAF3 FlexPWM_1 */
(uint32_t) &dummy, /* Vector # 682 FFLAG FlexPWM_1 */
(uint32_t) &dummy, /* Vector # 683 REF FlexPWM_1 */
(uint32_t) &dummy, /* Vector # 684 Reserved FlexPWM_1 */
(uint32_t) &dummy, /* Vector # 685 Reserved FlexPWM_2 */
(uint32_t) &dummy, /* Vector # 686 Reserved FlexPWM_2 */
(uint32_t) &dummy, /* Vector # 687 Reserved FlexPWM_2 */
(uint32_t) &dummy, /* Vector # 688 Reserved FlexPWM_2 */
(uint32_t) &dummy, /* Vector # 689 Reserved FlexPWM_2 */
(uint32_t) &dummy, /* Vector # 690 Reserved FlexPWM_2 */
(uint32_t) &dummy, /* Vector # 691 Reserved FlexPWM_2 */
(uint32_t) &dummy, /* Vector # 692 Reserved FlexPWM_2 */
(uint32_t) &dummy, /* Vector # 693 Reserved FlexPWM_2 */
(uint32_t) &dummy, /* Vector # 694 Reserved FlexPWM_2 */
(uint32_t) &dummy, /* Vector # 695 Reserved FlexPWM_2 */
(uint32_t) &dummy, /* Vector # 696 Reserved FlexPWM_2 */
(uint32_t) &dummy, /* Vector # 697 Reserved FlexPWM_2 */
(uint32_t) &dummy, /* Vector # 698 Reserved FlexPWM_2 */
(uint32_t) &dummy, /* Vector # 699 Reserved FlexPWM_2 */

(uint32_t) &dummy, /* Vector # 700 MRS_I CTU_0 */
(uint32_t) &dummy, /* Vector # 701 T0_I CTU_0 */
(uint32_t) &dummy, /* Vector # 702 T1_I CTU_0 */
(uint32_t) &dummy, /* Vector # 703 T2_I CTU_0 */
(uint32_t) &dummy, /* Vector # 704 T3_I CTU_0 */
(uint32_t) &dummy, /* Vector # 705 T4_I CTU_0 */
(uint32_t) &dummy, /* Vector # 706 T5_I CTU_0 */
(uint32_t) &dummy, /* Vector # 707 T6_I CTU_0 */
(uint32_t) &dummy, /* Vector # 708 T7_I CTU_0 */
(uint32_t) &dummy, /* Vector # 709 FIFO0_I CTU_0 */
(uint32_t) &dummy, /* Vector # 710 FIFO1_I CTU_0 */
(uint32_t) &dummy, /* Vector # 711 FIFO2_I CTU_0 */
(uint32_t) &dummy, /* Vector # 712 FIFO3_I CTU_0 */
(uint32_t) &dummy, /* Vector # 713 ADC_I CTU_0 */
(uint32_t) &dummy, /* Vector # 714 ERR_I CTU_0 */
(uint32_t) &dummy, /* Vector # 715 Reserved CTU_0 */
(uint32_t) &dummy, /* Vector # 716 MRS_I CTU_1 */
(uint32_t) &dummy, /* Vector # 717 T0_I CTU_1 */
(uint32_t) &dummy, /* Vector # 718 T1_I CTU_1 */
(uint32_t) &dummy, /* Vector # 719 T2_I CTU_1 */
(uint32_t) &dummy, /* Vector # 720 T3_I CTU_1 */
(uint32_t) &dummy, /* Vector # 721 T4_I CTU_1 */
(uint32_t) &dummy, /* Vector # 722 T5_I CTU_1 */
(uint32_t) &dummy, /* Vector # 723 T6_I CTU_1 */
(uint32_t) &dummy, /* Vector # 724 T7_I CTU_1 */
(uint32_t) &dummy, /* Vector # 725 FIFO0_I CTU_1 */
(uint32_t) &dummy, /* Vector # 726 FIFO1_I CTU_1 */
(uint32_t) &dummy, /* Vector # 727 FIFO2_I CTU_1 */
(uint32_t) &dummy, /* Vector # 728 FIFO3_I CTU_1 */
(uint32_t) &dummy, /* Vector # 729 ADC_I CTU_1 */
(uint32_t) &dummy, /* Vector # 730 ERR_I CTU_1 */
(uint32_t) &dummy, /* Vector # 731 Reserved CTU_1 */
(uint32_t) &dummy, /* Vector # 732 sgen_error SGEN */
(uint32_t) &dummy, /* Vector # 733 Reserved SGEN */

};


void dummy (void) {   /* Dummy ISR vector to trap undefined ISRs */
    while (1) {};  /* Wait forever or for watchdog timeout */
}

